"""
/gumoreska sends a joke to the chat
"""


from random import randint

from aiogram import Router
from datetime import datetime
from aiogram.filters import Command
from aiogram.types import Message, ReplyKeyboardRemove

router = Router()


last_used = {"gumoreska_id": 0, "date": 0}

gumoresky = (
    "Мля.. Марічку зміняв, вона мені о шостій ранку Кобзаря врізала напамʼять, я її на телефон, ска, зняв, цілий день, ЦІЛИЙ ДЕНЬ! передивлявся, сльози течуть, родичам в Канаду, в Німеччину відправив, ска!.. плачуть! (с) Гріша",
    "- то не твої котлети у посилці? бо я переживаю, що вони зіпсують, а скажуть на мене (с) Толік ",
    "- ну студенти зараз… нікому нічого не треба, кинули коробку і пішли, це …..ц (с) Толік",
    "- знаєш, яке свято сьогодні?? День народження Леонтовича, Щедрик, фа-ми-фа-реее ☝️ (с) Толік",
    "- А знаєш, чому холодно? А я тобі скажу (наставляє палець на тебе) - бо ти заходиш у гуртожиток і холод запускаєш, тому не скаржся, і кришку в туалеті після себе закривай, бо протяг гуляє, ага (с) Валерій",
    "- … людоньки, та мені по барабану той хОолод!, я чекаю шосту ранку, щоб скорше здряснути звідси і забути!, як платять, так і працюю!, мене все життя любоу гріла, Боже, як то бУло!… мені досі гаряче (с) Марічка",
    "- Тобі холодно? Я теж відчуваю.. дзвонив у тепломережі, ну воно ж нікому крім мене не треба (це …здец), ну я собі колорифер включив, ну а студенти…, мені жалко, хіба рюмАчку (сміється) (с) Толік",
    "- ТА ДЕ ХОЛОДНО?! Ти (..мля) молодий, кров гуляє, де холодно? Візьми шерстяні шкарпетки, насип гірчиці і спи, забудь про бабах, яблучко зʼїв і спиш собі, Отче наш не забувай, я тобі кАжу! (с) Гріша",
    "Хтось бачив чорну водолазку?",
    "Валєра сказав, що це не блок-пост у Валентини, а ЧІСТІЛІЩЕ",
    "Гріша: (склавши руки навхрест)\n- нащо тобі та кава, бабки тратиш!, я тобі кажу, іди зірви листочок смородини, мʼяти - це буде капец!\n\nМарічка: (руки в кишенях санітарного халату)\n- йой, баба, мені ця кава не потрібна!, я у молодості її напилася, і РЕЛЯКСОВА, і як мені тільки не робили, та йой, коли це було!..\n\nАнатолій: \n- кави хочеш попити? І добра тут кава, правда? Кажуть студенти, що подобається\n\nВалерій: (з під лоба, з попід окулярів, із-за скла)\n- кави хочеш? дивись не зламай там нічого, якщо зламаєш, то там камера записує\nІ видбитків пальців не залишай, не псуй",
    "Григорій інспектує по деяких кімнатах, стукається👀\nКомусь сказав: «давай, спи спокійно, забудь про бабах»",
    "Гучномовець схиляє до коректності!",
    "Увертюра до опери «Близенько»\n\nдалі 1 дія, центральний номер дії - аріозо пані Марічки «Сонце низенько, спішила в Близенько…»",
    "Арія Мирослава: «Вже дванадцята година, чи продасть мені Ярина?»\n\n20:47: хор студентів «В похід, в похід!»",
    "У кабінет психолога заходить пацієнт і каже: — Лікарю, я маю серйозну проблему. Дуже щвидко втомлююся. — Чому? — Мені щоночі сниться один і той самий сон: першу половину ночі я штовхаю потяг Київ-Львів, а другу — Львів-Київ. — Ну, уявіть собі, що другу половину ночі потяг Львів-Київ штовхаю я. — Ой, спасибі, лікарю. Заходить інший пацієнт: — Лікарю, маю таку муку. Першу половину ночі мені сниться, що я маю секс із білявкою, а другу — з брюнеткою. Дуже зморююсь. — Ну, уявіть собі, що першу половину ночі з білявкою сплю я. — А білявка симпатичніше. Чи не могли б ми помінятися? — Ніяк не можна. Другу половину ночі я штовхаю потяг Львів-Київ.",
    "Дівчина сказала, що не знає як розважитися у Львові. Причепив їй до рюкзаку георгіївську стрічку.",
    "Сниться диригентові страшний сон: ніби він геть розійшовся з оркестром, і всі музиканти грають шо попало. Прокидається диригент і виявляє - так воно і є.",
)


async def update_gumoreska():
    global last_used
    today = datetime.now().date()
    last_used = last_used["date"]

    if today != last_used:
        last_used["gumoreska_id"] = (last_used["gumoreska_id"] + 1) % 18
        last_used["date"] = today


@router.message(Command("gumoreska"))
async def gumoreska_handler(message: Message):
    text = f"гумореска дня!!\n\n{gumoresky[last_used["gumoreska_id"]]}"
    await message.answer(text)
